# -*- coding: utf-8 -*-

from logzero import logger

star = '竜'


def choose(doc, ZiGen):
    doc.sort(key=lambda x: (len(x[1]), x[0]))

    doc1=[]
    seen = set()
    for k, v in doc:
        # if k in seen:
        #     logger.warning("key seen "+k)
            # continue
        vs=[ x for x in v if x!=k ]
        vs1=''
        for u in vs[1:]:
            if u in ZiGen:
                logger.warning((k,v,u,"ZiGen"))
                continue
            if u in seen:
                logger.warning((k, v, u, "seen"))
                continue
            seen.add(u)
            vs1+=u
        if vs1:
            doc1.append((k,vs1))
    logger.info((len(doc),len(doc1)))
    return doc1

# 只选专一的
# 网	網罒罓㓁䋄䋞䍏𠔿𠕀𠕃𠕈𡇄𡉮𥾼𦉮𦉯𦉳𦉸𦉽𦉾𦊀𦋟𦌅𮊌𰃧𰃨⽹

def get_varriants():
    store={}
    givup=set()
    doc = open('YiTiZi/YiTi.txt').read().splitlines()
    doc = [x.split() for x in doc]
    for base,varriants in doc:
        for v in varriants:
            if v in store:
                givup.add(v)
            else:
                store[v]=base
    logger.info((len(givup),''.join(givup)[:1000]))

    R=set(store)&set(''.join(store.values()))
    logger.info((len(R),''.join(R)[:1000]))

    doc=[(k,v) for k,v in store.items() if k!=v  and k not in R and not set(v)&R  ]
    logger.info(len(doc))
    doc.sort()
    with open("YiTiZi/YiTiZi.txt", 'w') as f:
       for row in doc:
            l = '\t'.join(row)+'\n'
            f.write(l)

if __name__ == "__main__":
    get_varriants()
    """
[I 230410 00:50:12 YiTiZI:47] (1280, '𰌵𩩰𠮨𥹄𬐮銄䩡𣥐𫯉𣧏𦥕𭰏𩛞𬷽釶𬛮𢪛蛍㗫鞕𮌫𦬐鍊𫩞𤯓𪿨𩱋𦥑墤𫾴𠐾𦰋𰡧𨲛𤷈𰡀𠟅𨙨关𬽣𫜞㰟⺥⺙𪾇仮𨈣⺨𢓯𠯟𦬇𨐕�𫳜𢲙𨥧𩇇�𬔮歫𬢟𫧉𢱤𪙨䑍𫾩𰽤縡𢯊荕𭖣𬓷𠂭𬋵𨬛㟮𩙛𨤇䌃䜊䋄𢫸𰽟攓乁㘕鞞𫭂敺⻳𬴣硪㶥乚歺䮡𠛳𠭚𩿩𬩣勼𫈇𬑔𣻵𭸖𣍸⺂𥰰䳋榍𫴗⻲𦩍⺦㖹𣆛㥲㥶𮬘𡳚敌⻡𠘲𩾝𬩠𩊓笁𦉴埅𥷥𬆤𬧶𨢬儘
𠒉缏𦢯𧀓𨒙𢬩𰉿餘壤𪵹𭥚𬎕䢨㯏𭩛𫳡殽𬷋𫸇𣯧𣃵历𪱞𤊅𫮈𩰬㮊𠦃𬙜𡗓𫧺匂𰕡贠𠃓𢣕𬠹絪𫹂㰅发𫸞𰖲鮏𣮷䧛𦙡𤆆𠂤𣙼𬝙𠒰𩋙𰝼⺤𫶧𬓧侎升䊗脨𠭆乿𬧹𥄴䵺𬙥㟡𰫨𠑽𢦟㡯𥃩䓑⺖𫨳
𬁼𡓓丠𢑸𠀦佋𫨶𥼭靔粛𫾾𡗲𥒮𡨇𤍫𡦌𢆿鞸𫍚𥻑桀肶𦪑𠭯璖𦬠𰷣𬥝貈𢙥秇𪄮繇䌗𨟻𥜬唛𮫝鿆傶𬹲𠝝𫲱𣏔镉𦀚瓫沩働䚰宊𡶤𪧳𨔒𮈗塼洔鲶𡂖䘩𬉹𡂺輈𨽍䲆𠽾𧈩𫕿𬄄𡆡𦞬𫠩𭦌𩿇𭎔𭻾
𤶊𤯝迳𣥆𥂮痖𨋚坛𤆨䭑㘫⺺䌯笧𡵂𢵃𫀽𦣻蒙仟𢻰𪷇𢩭㚎㳕𫯂𤴥榐𢍉𬏬㱛𫯦𫣅𫰏𮜻貎𩋟𪪋㣫𪡼𫡃𩒷㮳𣆚𢚙齊𧖁𢘍㑆𨅊𡿭𡇈𪟊𬡝妳𤲺塜𥥛㩽𬮔彐�厂厂廑𣱾椦𫼁䶸𪌬𪁧𠾅鸛㐫𤈛䚟 
𥭆𨥌䩔𪜙魗𡢘𧝬𩲈𠯏𩁹悥𨦤𫝳揝⺭䌤𡪸𬆺𡉚𮋕觔㚀𣳇𤤛𪗓𬪴𥿅詧𬪵𰇭𪀩𪯙𫧡笚𬳗𩎛䣭𢍎𣙥煇𨐾炤𫾺垚𨕶㧃焭𦲥𤓝⺣㬶𩝝鎞𠱙𢦕娒𥡜𫶩𫵕𣹋𡰥𩫏㹞䟔𠪿𠮧𪟹𤓖𬴢𬩴𥪛𫨈𪰖𫷀𡃱𤰙
檘𫾸癵𭇅𩈖𠦟𫹯彁𫡿宝𬞩蘋𫈉𢒈䏈挘𠤭𢁓𢱦𠂈枠靀𭄭𬐳𤷡𨻳勶𭀦𬁱𰁳颤𩦐鰌𪴿𥘯〇踰𥄇𭡗𰇩⽈𡥅𠀄𬑻閒𤲸𬲟𣏌𮍵𬟲珎𫩄𫋵𧥄埳橆𠮮𢲔𫢣�𭶚𡨢𣴪⻮⻮鿭𥿫𧉳𥬞𧵤获䫲𤴓䪘𭞴㝵 
𬚆𣱙𢼛𪤯𬯉䄺𦤅𬆢𥿋𬔡𠔶𫮩懞𠤕𫓜𡭯㙺𭃂㝬䥇𫻾𮎛𢪨𬊞𣊧𡌪𤷒菞𦆈𤰔噏䩙𥫶𰤺𦼮捬𫢀䲣𦁲艸䂪系⿔𫸜𪂓𤽈𬩂垅𦕚𫴨𰽢𫲹𢱍𠃜𩃞𬟟䥴𦁫忬𫢢㤹𡨄䍒䫘龂𨦎𬗶𬇊𧡘𫹙𢷿呡𩕘沵𥰞𦬼
䟫𢽫⻐𫧨𨔡𪀝𩭗𫩣𬷠坓㐤𫥰鿮𬯭𭼲𩗩⻯𫳠勌𨨖𬺷⻂举𰠧𢿏𬋹䶏𬮈鉁㥐𪒶𬒴𫠱㖒粖⻫𩄮𡱒𥐟𫾯𬲖尅𪪺𥍟𠉌颕𫷫𠙎㫎𦞤⺘镦𡯵𥪡𥐯𫊣𧽚𡵃𬽜𫶞匨𡏛坝釢𰍢䦠开䬤㽯𫦡𬅐𧯴⻖𡆶𢳀𮎉
𡩚𣴱悤𬅸㢏𬜖𪧬肞衝⺩𤦏𰕕𤲶𨳲𧯣谉檦趂𫴅𮖄椝𣐩𬆧𬅻𥝢𣵁𢉧⺫𢄋𬒪𫌨𦹝䔠⻭𬕝𣢄㪋𰻎𣔶𣅱𰨛歰𠊫傹为𥂭𩚮䐗隓枨𠷎𪺏𤠁𪢙佨𬌊嚋𤕌㚢䣽𩛻�𦢿𧪮𪝌𡆥𬴺𩰏𡆲𰜹𬔠𢏝𪵍⺉⺉𬅼 
𤀮辺𤲡㢓𭇇搟𫨂㮛娚叚尢𬋺𥞪𫂫𬗪𫢛𬢚霝𥀂亝𢆰㣽𦴋煱憼䩩妛𠚫𩍔𧓽厷𬔟趞干𬌬𨕇⺲𫴪𱉉琕𧑀𮬽𪾼䚯𬂦𩇜𤿡讬𦵩𣎜𫳶渂𪠸𤞣𰿞𢄍𬺠𱀵𰕬𫹔釫�磂磂𨠑夌菑𫸭𠗲苐𣍤𨲾𮓿𫉨𠮠𤼐 
芸㘸𢧷𬢢𰀉𪚾𫍑𫳷𡔝𪺞𬷇𫠤钜𪼄佇㫑𪠔迊𫬁𨓍歾𣽙㤼𨽗串𤆄𦿬箥阥㭉𪾕𤘶𰫭𣚦𦓾盭䘺𫧀𰌩𤱢𠃊𤪪𫨲𠍙𠟭𦺸䃐𠴰𡥨𪥂𢆸𨈦鶾𡭏𧳰𥃧叓𫃠�鳱鳱钖㷨𫴎豊𬎿𩑡𫨷釐𠄒𫉬謼㱙㱿𫵆𩞃 
𰶿𡱔𭙎𡉄𣳮𤓯沪栄鲝⻃鑪𰸄𬜃𪴫夘𰮤𫻲窰㗃𣆁隶⺜𬥑埶暎𫶌𨖠㱝⻒寖𮥂𧸏𣤌𬅃䜭𦰂𥅘鞄䟢𤵸𣪌𫎘𤑗𬬊𥘙𥨃⺅从陜𰛑𧖷𬤼佛𰋵𪾡𣍨㙔厇𧍢药𨑳𣥈�𨉥午午䳶嵒⺱𧤜⺔𦛜宁𰍰𤍳𦔰 
囝塖𬟰拚𥆏粇㛯㕂𰠩𫦚汋𫺕𬃬𦤼𧶐𫧚𫲸𨊘懄𰪩𫪜𫿓𭍝华𫸢𦷁嵓䈕莶𬨞𤲇')
[I 230410 00:50:12 YiTiZI:50] (9203, '𣮃顢䨈𥹄爗閫汹颿𥔡故薘钷𨻈𦩨𣝆歸鷚駴請賤𥄙𨔥譔讠𬷆郄缌棖鏍莭曣歕诵绚䞉纬㿗仯齦䩛瘓鐔写鱭䌛𪂆茔票鶼𠴟會鳠𠏮創堕𩱋銜
誄缥臉鋗糶葮惱㤖鰟𦀤涧㲣𤷈鲺𫡰穡𪊑𥽣櫑偻这冋䒌㩠𦽓秌䉍蹣擇𪘩霁㰟𬩈镡㠁雂夃飩仌諺驿緩𢓯騤㤗摶𩎒𪫅俞𡽗誡樸𥍊䱅侬䬹辚𠆻𪙨譄籭矜釆𢭄𦭝𥗽吾淄頋鏲諢了𫲄𡎷詢醻
酿鐶斡𧅍摈觴抠訕坜𧉞鹩靨醟颣䡫鲹铌𨙸貶顎簽孌𠴨鮎僴𢱣敺酈櫃骑运鈿锅瓚藼𦾮筊鐃種蜆鬎孑鯤禺𥁄鴰𧓱儾𨋁𣣹䅐勼觊盡䔑銼𢶶鷀奄䘏擓鹕這謕嶁员㥶𪉖帐膩餛𥇇阳祇缔焧
謄埅漁樝鬓見饅鶨鉟笺睜璎準胧蒕缇糸䝺钯糆㴇绡瀦𧬪诩锽嘆剴壤篳扪隑𨗒誰㨢滊騁歴跀镤缉覎荏势镕嘯𤈦𬷋𣯧坒龀欎總𢆃啗鉗𧏊錶齏𩰬稱脥𩊿瘾鸾阰澁贠免椹脩絪问駒綖簾
綻匯𢭂辎医釦綴澈较态𩟐𩈑橃珲嶔順饻馱汇胜谰哒跃箇𢙸络韌喏搖懟趰𥇜𤚥徇垲䈎愍裄產墨藪滜捁翹叇𣸒尒旸精肃𣗖佥訟葒䇿般巋谴䵺𣭺𢦟𢘅锎蠟雡谌絢摄鱠孃𨏔𨩰对㟷驭阗
貃龚㮃韋隋虚䠶髦𦞛瘲铳鰕熌师𨴹顼貆幞殚嶄𨵢𪘥錫𩒝衆畴𮨻止讚慙夺徬謌雜阤嚮后㷻辠坞𧈹腸釕桀嶲纘䇂鑾𤓾驌浆䟄𩖁蛽𨶪貈鰍𥩁鍩虧訩𦓂𦟰塊賍𪄮玮𧒀舘𫹖擏奉䮫𩓋颭梱
𢠽閉薴鉤爕闅龭爭臘諜懶䬿磬啭𣖲㟟働撏订𰼹㾵蛲𨒉䟆杇𩞘化縂酳𨍩薩罇約𩏌硜懾韦棶貍鉭鱸臧櫺𰫏𩕲蓧𨿫巻輒𧹞𨦅顯𡱁椤鱞𥀫闻隕滤绖繕祢怂𤾸岖𧸖碸桺迳𩥃錈颊澜𨋚樑赉
亩蔭𠿡场癢梦进隩缴𫗧笧𩦶㬫牵啎撫俪眎矏玃𧼰缲鑑譫褢𦵕餎訊䃣侑貎銣騶柏眞衺𢥠癱鴇𡶅眝㟝数㣫𨁀毡輩㵚䓻寃㯉𣥎際异鹵憻芜個鹓䣩餶槍㑆价鮓缛鸝输𡎨鄆謎貛遙瞢躯鯫
腖𩋥鷦獦瘧䴸库𠎷輪经敽𣨐个眂䛀狄囒飦𩲺能乎𡧍敵襕愾濿繞藹僀断迻𠛪㗁归㴝衤頂謁縳𥦜𥰠蜑燼㺫𣱜廣觔𤪰弃鏷揅攈鲠詧湣䲼痾𢰺顰荭锌层𨟌錯𧥶霤䲘钊恺閾阏冪紘䀨漢䨛
蘧𠛩瀋碼𧕛䰲鸖㕰侴焭𩋰鋪纭啣隌䰪𤒯儿𩤵咼鄺㾨凶轼𠗺䪐辌娒鸼颒镛紉塏鮃藥㧉鄂籲独鼕餹𥮉瀘贻偰镍诊誥瞤鑵䆿马锳鈁毖𱆥箝礝婣䋹臚佃堙备蓠㠱𨥔䝡蕑耢𥶎遜闋𨥏槷墯
筳萌𡠗傤詳𧃭𧄔鑠鹜詐汛鴴魨飒辘𢪍輕𪒠躚𢾍𦣊蘋𠢤觏籴蟎歙剮𤺃𠥇很針挟訚睪𨖍漣灡狧柮臈灿壹𠨎蕴掺狮崵獭𡆎𨤘廦孋镏媧䕹楂纶镫邬崃贯𩈇䱭䌏硨鸫捿𦁚岡𧬊厕𧥣钇惧𤀇
閒𠊬蒐斥薟釣鳵罗搅纤鹐脗镭铁宓鄽讅釵损𪁊𡿺鞏遮䆷鲁癲諤䡇復摺鮒𢾊飊𥸃痠𪗋㱠邪𩎠捞䅇騲样䰃𪈹昫𧂅钶驂噑桨𦖟触斎瑎駝錒鵃雠记輵鴜尋衪達䢡铵㤾裈閔涂鹗鎂𨷖𤢻𢧜
鋅𤲖𡰌龄鷸仪𦆈欽饒緊劌飽銅𦪈唐𦬘熕𪇄睞㮤瑸賔蘄䩐𠤼䙜𠬝肫鯒障漠鲆闸穉𨊧杓介头穩畢驯䲣𠭘徴鷽烩顇艸系甆㮻块鍘謭轄仛褭僂绪镌勁鹉𡷨㡀敇堢鳐鹊溺䥴鱅挾䂓哅饞紈
捒訪燉闪烃衔穖奅谳㥷鯝𣶞䴹愤护训閬頏滛㦔㗉𩉘乔缅鍠枴展䤇廴䐽霩')
[I 230410 00:50:12 YiTiZI:53] 24237
    """
