# 独体字
# http://xh.5156edu.com/page/z2714m8730j18605.html
dutizi1='一乙二十丁厂七卜八人入乂儿九匕几刁了乃刀力又乜三亍干于士土工才下寸丈大兀与万弋上小口山巾千川彳个么久丸夕及广亡门丫义之尸已巳弓己卫孑子孓也女飞刃习叉马乡幺丰王井开夫天无韦专丐廿木五卅不太犬歹尤车巨牙屯戈互瓦止少曰日中贝内水见手午牛毛气壬升夭长片币斤爪父月氏勿欠丹乌卞文方火为斗户心尹尺夬丑爿巴办予书毋玉末未示戋正甘世本术石龙戊平东凸业目且甲申电田由央史冉皿凹民弗出皮矛母生失矢乍禾丘白斥瓜乎用甩氐乐匆册鸟主立半头必永耒耳亚臣吏再西百而页夹夷曳虫曲肉年朱缶乒乓臼自血角舟兆产亥羊米州农聿艮严求甫更束两酉豕来芈里串我身豸系羌良事雨果垂秉臾肃隶承柬面韭禺重鬼禹食彖象'
# http://yedict.com/zsts.htm
duti="㐁㐃㐄㐅㐆㐧㒳㔾㔿㕚㠪㠯㡀㡭㦮㬰㸦䍏䘮一丂七万丈三丌不与丏丐丑专且世丗丘业东両丣两严丧丨丩丬中丯丰丱串丳丶丷丹为丿乀乁乂乄久乆义之乌乍乎乐乑乗乙乚乛乜九也习乡书亅了予争亊事于互五井亙亜亞亥亦人亻以來儿兂兆兎兜入內八典兼冂内円冉冊册冎冖冘冫几凵凸凹函刀刁刂力办勹匆匕匚匸十千卄卅半卌卍卐卑卜卝卩厂厶又及发口史吏噩囗四土垂埀士夂夊夕大夨夫夬央头夷夹夾女子孑孒孓宀寸小尢尤尸尹尺屮屯山巛巜川州工巨巫己已巳巴巾巿帇干平年幺广廌廴廾廿弋弓弔弗彐彑彡彳心忄必戈戉戊戋我戶户戸戼手扌才承攴攵文斗斤斥方无旡日曰曱曲曳更月木朩未末本朱朿束来東果柬欠止歹歺毋毌母比毛氏民水氵氶永氺求灬為熏爪爫爲父爾爿片牙牛牜犬犭率玉王瓜瓦甘甚生用甩甫田由甲申甴电畢疋疌疒癶白皮皿目矛矢石示礻禸禹禺禾秉竹米粛糸糹纟缶网罒羊羽耂耒耳聿肀肃肅肉臣自臼臿舟艮色艹虍虫衤襾西覀見见角言訁譱讠谷豆豖豳豸貝贝赤身車车辰辵辶酉釆重金釒钅長镸长门阝隶隹雨非面革韦韭頁页风飛飞飠饣首骨鬥鬲鹵黃黄黍黽鼠鼡齊齐齿龙龜龟龰龴龵龶龹龺龻𠀀𠀁𠀆𠀈𠀉𠀊𠀌𠀍𠀑𠀟𠁁𠁘𠁡𠁢𠁣𠁤𠁦𠁧𠁩𠁰𠁱𠁽𠁾𠁿𠂀𠂁𠂂𠂆𠂇𠂈𠂉𠂍𠂎𠂒𠂙𠂜𠂣𠂤𠂯𠂼𠂿𠃉𠃊𠃋𠃌𠃍𠃎𠃑𠃓𠃛𠃜𠃢𠄌𠄎𠄓𠄙�𠑹𠔗𠔧𠕄𠕋𠕒𠕲𠘧𠘨𠙴𠚒𠡦𠤎𠤬𠥓𠥻𠥼𠥽𠦁𠦆𠦑𠦒𠦟𠬝𠱩𠷽𡆪𡆵𡕒𡗒𡗕𡗗𡗚𡗜𡗾𡘼𡙁𡤾𡬝𡭔𡯁𡰣𡰧𡰴𡳾𡳿𡴀𡷩𡸁��𡾍𡿦𡿨𢀑𢀚𢀳𢁺𢄉𢆍𢇈𢇍𢊁𢌰𢎗𢎜𢎟𢎠𢎣𢎧𢎨𢎯𢎱𢏚𢑚𢖩𢦍𢦏𢦐𢦑𢦒𢪐𣅯�𣅲𣇓𣎳𣎴𣎵𣎺𣏲𣐺𣒚𣥂𣦶𣫬𣬛𣶒𤉢𤊱𤓰𤕣𤕤𤣩𤦡𤮺𤯓𤰃𤰔𤰱𤰶𤱑𤲥𤴔𥄉𥆞𥈜𥈠𥈸𥘅𥝌𥫗𥸨𦈢𦉭𦏲𦘒𦝸𦣝𦣞𦥑𦥒𦥫𦥮𦥺𦫵𦰩𧑴𧘇𧰧𧰨𧾷𨈏𨈐𨈑𨤏𨳇𨸏𩇦𩇧𩇨𩙱𩙿𩰊𩰋𪓕𪓝𪚦𪛉𪜀𪜃𪜊𪤵𪩲𫝀𫝁�𫝃𫝄𫝅𫝆𫝇𫝉𫝔𫝕𫝖𫞓𫞕𫞖𫞟𫞪𫟈𫟋𫟚𫠠𫠣𫡃𫡆𫡑𫤬𫧋𫩏𫩑𫩙𫬯𫭒𫯛𫵎𫷃𬂛𬊓𬺶𬺷𬺹𬺻𬻆𬻇𬻒𬻫𬼂𬼄𬼉𬼘𬼺𬽡𭀜��𭅰𭈰𭐳𭕄𭖈𭠍𭴚𭺛𭺪𮂸𮍌𮠕𮠚�"

# https://www.zdic.net/hans/
duti2="⺀㐁㐃㐄㐅㐆㐧㔾㠯㦮㱐㸦䍏一丁七万丈三上下不与丏丐丑专且世丘丙业东丣两丨丩个丫丬中丰丱串丶丷丸丹为主丿乀乁乃乄久么义之乌乍乎乏乐乑乖乗乘乙乚乛乜九乞也习乡书亅了予亊二于亏云互亓五井亘亚亜亡亥亦产人亻儿允兂元入內八其冂内円冉册冖冘农冫几凡凵凸凹出击刀刁刂刃力办勹勺匆匕匚匸十卅升午半卌卍卐卜卝卞卣卤卩卫厂厶又叉及发口史噩囗囟土垂士壬夂夊夕大太夫夬夭央失头夹奭女子孑孒孓宀寸小尔尢尤尸尺屯山川州工巨己已巳巴巾干平幺广廴廿开弋弓弗弟彐彑彡彳心忄必戈戉戋戍成户戼手扌才承攵文斗斤斥方无旡日曰曱曲曳更月木朩未末本术朱朿束来東柬欠止歹毋毌母毛氏氐民气水氵氶永求火灬為爪爲父爿片牙牛牜犬犭玄玉王玍瓜瓦甘生用甩甫田由甲申电畢疋疌疒白皮皿目矢示礻禹禺禾秉穴竹米粛纟缶罒羊耂而耒耳聿肅肉臣自臼舌舟艮良芈虫血衣衤襾西覀角言訁讠豆豕豸贝赤身車车辛辰辶酉酋重釒钅長镸长门阝隶雨非面革韦韭頁页飛飞飠饣马鬼鸟鹵麦黽龙龜龰龴龵龶卑既者艹辶"

if __name__=="__main__":
    dutizi=''
    sets=[dutizi1,duti,duti2]
    for i,x in enumerate(sets):
        print(i,len(x))
        dutizi+=x
    dutizi=list(set(dutizi))
    dutizi.sort()
    print(len(dutizi))
    with open("dutizi.txt","w") as f:
        for x in dutizi:
            f.write(x+'\n')

"""
0 280
1 725
2 403
813
"""            