# 结构 12
# 参考 https://www.unicode.org/charts/PDF/U2FF0.pdf
JieGou = '〾⿰⿱⿲⿳⿴⿵⿶⿷⿸⿹⿺⿻'

# 康熙部首 214
# 参考https://www.unicode.org/charts/PDF/U2F00.pdf
KangxiRadicals = "一丨丶丿乙亅二亠人儿入八冂冖冫几凵刀力勹匕匚匸十卜卩厂厶又口囗土士夂夊夕大女子宀寸小尢尸屮山巛工己巾干幺广廴廾弋弓彐彡彳心戈戶手支攴文斗斤方无日曰月木欠止歹殳毋比毛氏气水火爪父爻爿片牙牛犬玄玉瓜瓦甘生用田疋疒癶白皮皿目矛矢石示禸禾穴立竹米糸缶网羊羽老而耒耳聿肉臣自至臼舌舛舟艮色艸虍虫血行衣襾見角言谷豆豕豸貝赤走足身車辛辰辵邑酉釆里金長門阜隶隹雨靑非面革韋韭音頁風飛食首香馬骨高髟鬥鬯鬲鬼魚鳥鹵鹿麥麻黃黍黑黹黽鼎鼓鼠鼻齊齒龍龜龠"
# 康熙部首及补充 115
# 参考 https://www.unicode.org/charts/PDF/U2E80.pdf
CJKRadicalsSupplement = "⺀⺁⺂⺃⺄⺅⺆⺇⺈⺉⺊⺋⺌⺍⺎⺏⺐⺑⺒⺓⺔⺕⺖⺗⺘⺙⺛⺜⺝⺞母⺠⺡⺢⺣⺤⺥⺦⺧⺨⺩⺪⺫⺬⺭⺮⺯⺰⺱⺲⺳⺴⺵⺶⺷⺸⺹⺺⺻⺼⺽⺾⺿⻀⻁⻂⻃⻄⻅⻆⻇⻈⻉⻊⻋⻌⻍⻎⻏⻐⻑⻒⻓⻔⻕⻖⻗⻘⻙⻚⻛⻜⻝⻞⻟⻠⻡⻢⻣⻤⻥⻦⻧⻨⻩⻪⻫⻬⻭⻮⻯⻰⻱⻲龟"

# 国学大师部首 280
# http://www.guoxuedashi.net/zidian/bscz.php
BuShou = '一丨丶丿乙乚乛亅丷二亠人亻儿入八冂冖冫几凵刀刂力勹匕匚匸十卜卩厂厶又廴讠阝兀口囗土士夂夊夕大女子宀寸小尢尸屮山巛川工己巳巾干幺广廾弋弓彐彑彡彳忄扌氵犭纟艹辶门飞饣马卝厄尣心戈戶户手支攴攵文斗斤方无旡日曰月木欠止歹殳毋比毛氏气水火灬爪爫父爻爿片牙牛牜犬王瓦礻禸耂肀见贝车长韦风业歺母玄玉瓜甘生用田疋疒癶白皮皿目矛矢石示禾穴立罒衤钅鸟龙先竹米糸糹缶网羊羽老而耒耳聿肉臣自至臼舌舛舟艮色艸虍虫血行衣襾覀页齐克卤見角言谷豆豕豸貝赤走足身車辛辰辵邑酉釆里镸麦采金釒長門阜隶隹雨靑青非靣飠鱼齿面革韋韭音頁風飛食首香骨鬼馬高髟鬥鬯鬲魚鳥鹵鹿麥麻黄黃黍黑黹鼎黽鼓鼠鼻齊齒龍龜龠'

# # http://yedict.com/zsts.htm
# KangXiBuShou="⼀⼁⼂⼃⼄⼅⼆⼇⼈⼉⼊⼋⼌⼍⼎⼏⼐⼑⼒⼓⼔⼕⼖⼗⼘⼙⼚⼛⼜⼝⼞⼟⼠⼡⼢⼣⼤⼥⼦⼧⼨⼩⼪⼫⼬⼭⼮⼯⼰⼱⼲⼳⼴⼵⼶⼷⼸⼹⼺⼻⼼⼽⼾⼿⽀⽁⽂⽃⽄⽅⽆⽇⽈⽉⽊⽋⽌⽍⽎⽏⽐⽑⽒⽓⽔⽕⽖⽗⽘⽙⽚⽛⽜⽝⽞⽟⽠⽡⽢⽣⽤⽥⽦⽧⽨⽩⽪⽫⽬⽭⽮⽯⽰⽱⽲⽳⽴⽵⽶⽷⽸⽹⽺⽻⽼⽽⽾⽿⾀⾁⾂⾃⾄⾅⾆⾇⾈⾉⾊⾋⾌⾍⾎⾏⾐⾑⾒⾓⾔⾕⾖⾗⾘⾙⾚⾛⾜⾝⾞⾟⾠⾡⾢⾣⾤⾥⾦⾧⾨⾩⾪⾫⾬⾭⾮⾯⾰⾱⾲⾳⾴⾵⾶⾷⾸⾹⾺⾻⾼⾽⾾⾿⿀⿁⿂⿃⿄⿅⿆⿇⿈⿉⿊⿋⿌⿍⿎⿏⿐⿑⿒⿓⿔⿕"
# bushou2="⺀⺁⺂⺃⺄⺅⺆⺇⺈⺉⺊⺋⺌⺍⺎⺏⺐⺑⺒⺓⺔⺕⺖⺗⺘⺙⺚⺛⺜⺝⺞⺟⺠⺡⺢⺣⺤⺥⺦⺧⺨⺩⺪⺫⺬⺭⺮⺯⺰⺱⺲⺳⺴⺵⺶⺷⺸⺹⺺⺻⺼⺽⺾⺿⻀⻁⻂⻃⻄⻅⻆⻇⻈⻉⻊⻋⻌⻍⻎⻏⻐⻑⻒⻓⻔⻕⻖⻗⻘⻙⻚⻛⻜⻝⻞⻟⻠⻡⻢⻣⻤⻥⻦⻧⻨⻩⻪⻫⻬⻭⻮⻯⻰⻱⻲⻳"


# 构件 208
# http://yedict.com/zsts.htm 难检字元
NanJianZiYuan = "一丨丿丶乀亅乙⺄乛乚亻讠冫阝卩刂乂冖丷亠厶勹匚凵冂廴丂丩㔾⺁⺈⺊氵忄扌饣丬纟犭彳艹屮廾宀辶夂彡巛囗彐彑乇卂㐄⺌礻爫灬攵攴殳夬爿巿厷耂丏旡冘帀肀⺗⺧㝉犮歺衤钅疒癶氶氐罒疋冋夗丱戉戊⺪㐱㠯糹糸虍巟耒屰戍戌夅舛乑艸⺷⺶⺮㐫䏍镸豸孛夆呙夋豕巠肙冏丣寽甹妟亜㡀㐬隹畀沓叕咅亟匊坴咼疌夌囷罙匋臽厓甾叀㑒㝵贲臿畐癸耑曷矦壴叚咠彖昷昜敄枼㒸㚇髟鬲冓衮盍隺隼邕尃䍃啇堇翏屚菐桼殸殹㒼賁棥戢豦尞粦覃矞黹歯黽㥁畺睘蒦豊喿敫巤龜褱雚霝龠矍䜌"
# 624
# http://www.guoxuedashi.net/zidian/bujian/
Bujian1 = '一丨丿丶亅乚乀乙乛𡿨𠃑十二厂丁丂匚七丅丆𠀁冂冖刂卜人八亻儿勹几匕乂九入丷亠冫讠又厶阝刀凵力卩乃廴了丩土艹大扌工寸干士廾卄三兀尢亏弋亍丌于与才万𠫓口山巾小上亼夂彳犭彡夕亽丸亾凡千饣勺乇及川个久亇𠀆宀氵辶忄广亡门之女尸弓子屮幺巛巳彐纟彑己马也刃卂飞乡叉木王戈夫歹犬丰比廿耂井天瓦支开不元友云车旡尤牙五巨屯厷厄无韦帀巿朩日止曰水卝攴中贝少内禸见𠃛攵月从爫欠殳毛斤勿手牜牛今氏分爻夭凶公片父厃气戶壬仌丯尣爪长风介化反升卬火心灬方礻户文斗六冘冗爿巴允尹肀丑弔夬毋予丮毌𠬝夨⺗石示戊古可未去甘圥正世玉左卉丙右犮龙朮卌田目罒皿旦冋业且由氺甲占北兄冉央电囚冎歺禾白矢钅生令鸟用瓜句匃夗包乍丘氐卯刍疒穴立衤必玄主龸皮矛出癶母台疋召弗氶𢀖𠬤耳覀臣共而至戌圭耒吉西页有百亘幵朿寺襾列戍虫吅虍早回同曲此吕光尗肉吋臼舟自缶合竹各多舛舌刖囟先行血兆色夅兇𠂭𠂢𠂤𦈢米羊衣屰并次齐交安弚㐫糹羽糸艮聿厽艸弜叒車豆酉豕走束甫辰镸赤夾克麦巠丣貝見里囬足冏肖旲步呂卤肙㒳角身豸釆谷免每余告夆孚辵系兌囪言良辛夋𠃬雨林者幸其取臥青來或奇坴東戔昔亞長靑靣奄玨夌臤疌直叀門非尚虎果具畀咼卓易齿金隹飠鱼卑兔采阜侖臽兒臾爭𨸏𫂱炎炏享放京卒咅宗並隶叕帚彔甾頁革壴面咸柬垚畐昚枼甚垔骨品禺韭曷昜是昷鬼風食重香俞𣶒音酋首娄韋飛彖叚馬髟鬲真莫鬥尃盍貢員豈丵秝鬯隻倉舀奚高兼离冡麥票黄堇區專鹵婁鳥魚祭鹿麻啇翏敢參黃厤堯尞萬殼覃黑雈貴買單黹鼎菐番黍喬爲粦曾遂絲鼓爾霝監雚壽歷齒畾黽瞿睘睪喿鼠僉鼻龜龠與會詹龍齊亶襄'
# 237
# http://www.guoxuedashi.net/zidian/bujian/jrong.php
Bujian2 = '乙乀⺄七𠤎万萬与與丐丏东東丰豐为為义義人亻人𠆢仑侖八丷冂⺆册𠕁册冊几𠘨刀⺈刀刂刀𠂊刃刄匀勻千チ卜⺊卤鹵卩㔾双雙发發娄婁子孑小⺌小⺗小𡭔尔尓尚尙屮屮川巛己巳市巿并幷廾廾开幵彐⺕彐彑心㣺心忄户戶手扌无無日⺜日曰昷𥁕月⺼木朩木𣎳术朮来來止龰毋毌水氵水氺爪爫爪爫牛牜犬犭玄𤣥王壬王𡈼王𤣩疋𤴓疋𤴔示礻竹⺮糸糹糸纟絲𢇁网罓羊⺶羊⺷羊𦍌聿⺻聿𦘒臣𦣝臣𦣞臼𦥑艹艸衣衤西覀见見言訁言讠贝貝足𧾷車车金釒金钅长長长镸门門面靣韦韋页頁风風飞飛食飠食饣食𩙿马馬鱼魚鸟鳥麦麥黄黃黾黽齐齊齿齒龙龍龟龜口囗'
# 拆字 485
# 参考 https://github.com/cjkvi/cjkvi-ids
BujianIDS = "αℓ↔↷①②③④⑤⑥⑦⑧⑨⑩⑪⑫⑬⑭⑮⑯⑲△⺄⺆⺊⺌⿰⿱⿲⿳⿴⿵⿶⿷⿸⿹⿺⿻〇いよりコサスユ㇀㇁㇂㇄㇅㇇㇈㇉㇊㇋㇌㇍㇎㇓㇘㇝㇞㇢㇣㐁㐄㐅㐆㐧㔾㠯㱐㸦䍏一丈丏丐丑专且世丘东丣丨丩丬丱丶丷丹为丿乀乁乄久乍乎乐乑乗乙乚乛乜九也乡书亅了亊事于井亜人亻以兂兆入八冂円冉册冖冘冫几凵凸凹刂勹匚匸十卌卍卐卜卝卩厂厶又及发口史囗夂夊央头女子孑孒孓宀寸小尢尸尺山川州工巨己已巳巴巾干年广廴廿弓彐彑彡彳心忄戉戊我戼手扌才承攵斗旡日曰曱曲曳月木朩未末本朱朿束来東柬欠止毋毌母比氏民氵永灬為熏爪爲爿片牙牛牜犬犭瓜瓦甘生田由甲申疋疌疒白皮皿目示礻禹禺米粛纟缶罒耂耳肃肅肉臣自臼舟艮虫衤襾见角言訁讠谷豆豸贝身車车辶酉重釒钅长门阝隶隹非革韦頁页飛飞饣黽齿龜龰龴龵龶車龜龜丹女年卑既者艹辶華龜𛂦𠀀𠀈𠀉𠀌𠀍𠀑𠀟𠁁𠁣𠁦𠁧𠁩𠁰𠁱𠁾𠂀𠂂𠂆𠂇𠂉𠂊𠂍𠂎𠂒𠂣𠂼𠃉𠃊𠃋𠃌𠃍𠃎𠃑𠃓𠃛𠃜𠃢𠄌𠄎𠄏𠄓𠄔𠄙𠆢𠑹𠕄𠘧𠘨𠙴𠚒𠤬𠥓𠥻𠦁𠦑𠦮𠾃𡆵𡋬𡗒𡦹𡭔𡯁𡰣𡰴𡳿𡸁𡿨𢀓𢁺𢎗𢎜𢎧𢎱𢑚𢚎𣅲𣎳𣎵𣒚𣥂𣦶𣫬𤓰𤕪𤣩𤦡𤰃𤴔𥆞𥘅𥝌𥫗𦉭𦣝𦣞𦥒𦥺𦫵𧘇𧰨𨈏𨈐𨈑𨙨𨳇𩇦𩇧𩇨𩙱𩙿𩰊𩰋𪓕𪓝𪚦𪚴𪛉𪜀𫝀𫠣𬂛𬺷𬺻𬻂𬻆𬻞𬻟𬻿𬼁𬼂𬼄𬼘𬼙𭀡𭐳𭔥𭕄𭣔𭨘𭺪𮍌𮠕乁凵北卑及多尢㠯衣豕𠣞"
#  '⿰⿱⿲⿳⿴⿵⿶⿷⿸⿹⿺⿻αℓ①②③④⑤⑥⑦⑧⑨⑩⑪⑫⑬⑭⑮⑯⑲△⺄⺆⺊⺌いよりコサスユ㇀㇇㇉㇋㇌㇍㇎㇓㇞㇢㇣𛂦一丈丏丐丑专且世丘东丣丨丩丬丱丶丷丹为丿乀乁乄久乍乎乐乑乗乙乚乛乜九也乡书亅亊事于井亜人亻以兂兆入八冂円冉册冖冘冫几凵凸凹刂勹匚匸十卌卍卐卜卝卩厂厶又及发口史囗夂夊央头女子孑孒孓宀寸小尢尸尺山川州工巨己已巳巴巾干年广廴廿弓彐彑彡彳心忄戉戊我戼手扌才承攵斗旡日曰曱曲曳月木朩未末本朱朿束来東柬欠止毋毌母比氏民氵永灬為熏爪爲爿片牙牛牜犬犭瓜瓦甘生田由甲申疋疌疒白皮皿目示礻禹禺米粛纟缶罒耂耳肃肅肉臣自臼舟艮虫衤襾见角言訁讠谷豆豸贝身車车辶酉重釒钅长门阝隶隹非革韦頁页飛飞饣黽齿龜龰龴龵龶㐁㐄㐅㐆㐧㔾㠯㱐㸦䍏車龜龜丹女年卑既者艹辶華龜𠀀𠀈𠀉𠀌𠀍𠀑𠀟𠁁𠁣𠁦𠁧𠁩𠁰𠁱𠁾𠂀𠂂𠂆𠂇𠂉𠂊𠂍𠂎𠂒𠂣𠂼𠃉𠃊𠃋𠃌𠃍𠃎𠃑𠃓𠃛𠃜𠃢𠄌𠄎𠄏𠄓𠄔𠄙𠆢𠑹𠕄𠘧𠘨𠙴𠚒𠤬𠥓𠥻𠦁𠦑𠾃𡆵𡗒𡦹𡭔𡯁𡰣𡰴𡳿𡸁𡿨𢀓𢁺𢎗𢎜𢎧𢎱𢑚𣅲𣎳𣎵𣒚𣥂𣦶𣫬𤓰𤕪𤣩𤦡𤰃𤴔𥆞𥘅𥝌𥫗𦉭𦣝𦣞𦥒𦥺𦫵𧘇𧰨𨈏𨈐𨈑𨙨𨳇𩇦𩇧𩇨𩙱𩙿𩰊𩰋𪓕𪓝𪚦𪚴𪛉𪜀𫝀𫠣𬂛𬺷𬺻𬻂𬻆𬻞𬻟𬻿𬼁𬼂𬼄𬼘𬼙𭀡𭐳𭕄𭣔𭨘𭺪𮍌𮠕乁凵北卑及多尢㠯衣豕𠣞'
# 202
# 参考 https://hanzi.unihan.com.cn/School/MajorCmp
Component = "八白勹贝鼻匕比釆灬冫癶卜艹长厂车臣辰齿彳赤虫辶寸大歹刀刂斗豆儿而耳匚方飞非风缶阝父干甘高戈革艮工弓廾谷骨鼓瓜广鬼丨丷禾黑虍户黄火几己彐见角卩巾斤钅金冂臼口耂老耒里力立隶龙麻马麦毛矛门米冖糸宀面皿母木目疒鸟女皮片丿攴攵齐气凵欠青犭犬人亻日肉入色山彡舌身生尸十饣石食矢豕氏手扌首殳黍氵水厶纟罒田亠土瓦网囗文无夕西香小忄心辛穴血牙疋讠言羊幺页一衤衣乙弋音廴尢酉又鱼羽雨聿月爫支夂止至豸舟竹丶爪丬隹子自走足⺌⺮⻊"


if __name__ == "__main__":
    bujian = ""
    bujians = [JieGou, KangxiRadicals, CJKRadicalsSupplement,
               BuShou, NanJianZiYuan, Bujian1, Bujian2, BujianIDS, Component]
    for i, x in enumerate(bujians):
        print(i, len(x))
        bujian += x
    bujian = list(set(bujian))
    bujian.sort()

    bujian = ''.join(bujian)
    print(len(bujian))
    with open("bujian.txt", "w") as f:
        for x in bujian:
            f.write(x+'\n')

"""
0 13
1 214
2 115
3 280
4 208
5 624
6 237
7 485
8 202
1134
"""
